src/Documents/SoldProducts/SoldProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SoldProducts</name>
  <basedOn>Document.ImportedProducts</basedOn>
  <registerRecords>AccumulationRegister.RemainingProducts</registerRecords>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contract</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currency</types>
    </type>
  </attributes>
  <attributes>
    <name>Storage</name>
    <type>
      <types>EnumRef.Storage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Nomenclature</name>
      <type>
        <types>CatalogRef.Nomenclature</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/RemainingProducts/RemainingProducts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>RemainingProducts</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Nomenclature</name>
    <type>
      <types>CatalogRef.Nomenclature</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Storage</name>
    <type>
      <types>EnumRef.Storage</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/SoldProducts/ObjectModule.bsl
Procedure Filling(FillingData, StandardProcessing)
	//{{__CREATE_BASED_ON_WIZARD
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.
	If TypeOf(FillingData) = Type("DocumentRef.ImportedProducts") Then
		// Filling the headline
		For Each CurRowProducts In FillingData.Products Do
			NewRow = Products.Add();
			NewRow.Nomenclature = CurRowProducts.Nomenclature;
			NewRow.Price = CurRowProducts.Price;
			NewRow.Quantity = CurRowProducts.Quantity;
		EndDo;
	EndIf;
	//}}__CREATE_BASED_ON_WIZARD
EndProcedure

Procedure Posting(Cancel, Mode)
	//{{__REGISTER_REGISTERRECORDS_WIZARD
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.

	// register RemainingProducts Expense
	RegisterRecords.RemainingProducts.Write = True;
	For Each CurRowProducts In Products Do
		Record = RegisterRecords.RemainingProducts.Add();
		Record.RecordType = AccumulationRecordType.Expense;
		Record.Period = Date;
		Record.Nomenclature = CurRowProducts.Nomenclature;
		Record.Storage = Storage;
		Record.Quantity = CurRowProducts.Quantity;
		Record.Price = CurRowProducts.Price;
	EndDo;

	//}}__REGISTER_REGISTERRECORDS_WIZARD
EndProcedure
